<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
    <head>
        <meta http-equiv="content-type" content="text/html; charset=utf-8" />
        <meta name="description" content="Your description goes here" />
        <meta name="keywords" content="your,keywords,goes,here" />
        <meta name="author" content="Your Name" />
        <link rel="stylesheet" type="text/css" href="css/default.css" media="screen,projection" />
        <!--import.om.css not found-->
        <title>Om uppgiften - Kand-14:32 - Fr&aring;gesvarssystem baserat p&aring; Wikipedia</title>
    </head>

    <body id="om">
        <div id="container">
            <div id="header"> 
                 <h1>Kand-14:32 - Fr&aring;gesvarssystem baserat p&aring; Wikipedia</h1>
            </div>
            <div id="nav">
                <div id="nav_left"></div>
                <ul>
                    <li>
                        <a href="index.html" id=_1>
                            <img src="resources/house.png" style="vertical-align: middle"/>
                        </a>
                    </li>
                    <li><a href="schema.html" id=_2>Schema</a></li>
                    <li><a href="dokument.html" id=_3>Dokument</a></li>
                    <li><a href="forum.html" id=_4>Forum</a></li>
                    <li><a href="om.html" id=_5>Om uppgiften</a></li>
                    <li><a href="kontakt.html" id=_6 style="border: 0">Kontakt</a></li>
                </ul>
                <div id="nav_right"></div>
            </div>
            <div id="content">
                <!--begin-->
                    <h4>Bakgrund</h4>
                    IBM:s Watson-dator &auml;r ett fr&aring;gesvarssystem som slog tv&aring;
                    storm&auml;stare i Jeopardy under v&aring;ren 2011. Watson har samlat
                    p&aring; sig massor av kunskap fr&aring;n flera olika k&auml;llor, t.ex.
                    olika uppslagsverk men ocks&aring; fr&aring;n bloggar och andra
                    internet-texter. En av de viktigaste informationsk&auml;llorna
                    f&ouml;r Watson &auml;r Wikipedia, f&ouml;r att det inneh&aring;ller mycket
                    information som dessutom &auml;r l&auml;nkad. Det p&aring;g&aring;r flera olika
                    forskningsprojekt runtom i v&auml;rlden f&ouml;r att kunna anv&auml;nda sig
                    av kunskapen som finns lagrad i Wikipedia. Ett av dessa &auml;r
                    DBpedia, som automatiskt skapar en gigantisk s&ouml;kbar ontologi
                    &ouml;ver alla Wikipedias artiklar. Men det finns ocks&aring; andra
                    ontologier, Freebase &auml;r en s&aring;dan som dessutom har ett
                    v&auml;ldigt trevligt s&ouml;k-API. Nu f&ouml;r tiden anv&auml;nds Watson f&ouml;r
                    att diagnosticera lungcancer, men det &auml;r en helt annan
                    historia.

                    <h4>Projektbeskrivning</h4>
                    Uppgiften &auml;r att bygga ett fr&aring;ge-svarssystem f&ouml;r en viss
                    dom&auml;n. Till hj&auml;lp kan ni anv&auml;nda DBpedia eller Freebase, men
                    ocks&aring; r&aring; Wikipediadata, liksom andra databaser vid behov.
                    Eller en kombination av alltihop.

                    <h5>M&ouml;jliga &auml;mnen kan vara:</h5>

                    <p>
                    <em>Musik:</em> att st&auml;lla fr&aring;gor om artister, grupper, l&aring;tar, album,
                    &aring;rtal, och mer avancerade saker som vilka som har samarbetat
                    med varandra, var de har bott genom &aring;ren, hur gammal n&aring;gon
                    var n&auml;r denne slog igenom. &auml;ven fr&aring;gor om topplistor, betyg,
                    skivbolag, m.m. kan vara av intresse.
                    </p>
                    <p>
                    <em>Geografi:</em> fr&aring;gor om l&auml;nder, st&auml;der, sj&ouml;ar, floder. Mer
                    avancerade fr&aring;gor kan vara vilka grannl&auml;nder som ett land
                    har, hur stor en stad &auml;r, vilka de st&ouml;rsta sj&ouml;arna &auml;r, etc.
                    </p>
                    <p>
                    <em>Filmer:</em> sk&aring;despelare, regiss&ouml;rer, &aring;rtal, betyg, etc.
                    </p>
                    <p>
                    I projektet ing&aring;r ocks&aring; att skriva en parser, eller
                    grammatik (eller motsvarande) f&ouml;r att f&ouml;rst&aring; fr&aring;gorna. F&ouml;r
                    att g&ouml;ra detta m&aring;ste ni specificera vilken sorts fr&aring;gor som
                    systemet ska kunna klara av, och hur de ska &ouml;vers&auml;ttas till
                    databasfr&aring;gor. Sedan m&aring;ste &auml;ven svaren presenteras p&aring; ett
                    f&ouml;rst&aring;eligt s&auml;tt.
                    </p>
                <!--end-->                                                                  
            </div>
            <p>&#xa9; 2013 <a href="#" style="float: right">Top</a> </p> 
        </div>
    </body>
</html>

